tap "delphinus/sfmono-square"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jez/formulae"
tap "khanhas/tap"
tap "neovim/neovim"
tap "rigellute/tap"
tap "tmux/tmux", "https://github.com/tmux/tmux"
tap "yt-dlp/taps"
brew "gettext"
brew "abook"
brew "aircrack-ng"
brew "alac"
brew "gdbm"
brew "pcre2"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "little-cms2", link: false
brew "ant"
brew "libssh2"
brew "aria2"
brew "aspell"
brew "atool"
brew "autoconf"
brew "automake"
brew "python@3.11"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "bdw-gc"
brew "bison"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "bitlbee"
brew "blueutil"
brew "boost"
brew "broot"
brew "libuv"
brew "node", link: false
brew "cash-cli"
brew "cassandra"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "libogg"
brew "libvorbis"
brew "pango"
brew "ffmpeg"
brew "libtool"
brew "cmus"
brew "rtmpdump"
brew "curl"
brew "unixodbc"
brew "krb5"
brew "php"
brew "composer"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "dark-mode"
brew "dbus"
brew "diff-so-fancy"
brew "docbook"
brew "docker", link: false
brew "elinks"
brew "erlang"
brew "eslint", link: false
brew "exa"
brew "exiftool"
brew "extract_url"
brew "fasd"
brew "fd"
brew "fdupes"
brew "fzf"
brew "gcc"
brew "gdrive"
brew "genact"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-flow"
brew "go"
brew "gradle"
brew "grip"
brew "hexcurse"
brew "highlight", link: false
brew "htop"
brew "http-server"
brew "httpd"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "python@3.8"
brew "imagemagick"
brew "ios-deploy"
brew "irssi"
brew "isync"
brew "jdupes"
brew "jq"
brew "jsdoc3"
brew "json-c"
brew "json-glib"
brew "lf"
brew "libav"
brew "libcaca"
brew "libsigc++"
brew "libssh"
brew "ruby"
brew "libstfl"
brew "unibilium"
brew "libtermkey"
brew "libvo-aacenc"
brew "libvterm"
brew "luarocks"
brew "lynx"
brew "lzlib"
brew "m-cli"
brew "macvim", link: false
brew "mas"
brew "mdp"
brew "media-info"
brew "midnight-commander"
brew "mkdocs"
brew "mkvalidator"
brew "mkvtoolnix", link: false
brew "moreutils", link: false
brew "mplayer"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "msmtp"
brew "multimarkdown"
brew "tokyo-cabinet"
brew "mutt"
brew "mysql"
brew "ncdu"
brew "notmuch"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "nnn"
brew "node@10"
brew "node@12"
brew "node@14"
brew "noti"
brew "optipng"
brew "p7zip"
brew "par"
brew "tree"
brew "pass"
brew "picard-tools"
brew "poppler"
brew "portaudio"
brew "prettier", link: false
brew "prettyping"
brew "python@2"
brew "python@3.7"
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "s-search"
brew "sc-im"
brew "sd"
brew "socat"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "svgo", link: false
brew "tag"
brew "task"
brew "terminal-notifier"
brew "texi2html"
brew "the_silver_searcher"
brew "thefuck"
brew "thrift"
brew "tig"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tor"
brew "trash"
brew "typescript"
brew "unrar"
brew "unrtf"
brew "urlview"
brew "vifm"
brew "vim"
brew "w3m"
brew "watchman"
brew "webkit2png"
brew "webpack", link: false
brew "weechat"
brew "wget"
brew "xmlrpc-c"
brew "yarn"
brew "yasm"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-history-substring-search"
brew "jez/formulae/git-heatmap"
brew "rigellute/tap/spotify-tui"
brew "yt-dlp/taps/yt-dlp"
cask "1password"
cask "ableton-live-suite"
cask "adobe-acrobat-reader"
cask "alt-tab"
cask "audacity"
cask "balenaetcher"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "blackhole-64ch"
cask "chromedriver"
cask "chromium"
cask "cleanmymac"
cask "cycling74-max"
cask "discord"
cask "docker"
cask "dropbox"
cask "duckduckgo"
cask "firefox"
cask "firefox-developer-edition"
cask "font-awesome-terminal-fonts"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-drive"
cask "grammarly"
cask "hyper"
cask "hyperswitch"
cask "ilok-license-manager"
cask "iterm2"
cask "jitsi"
cask "karabiner-elements"
cask "lastfm"
cask "linearmouse"
cask "megasync"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-edge-dev"
cask "mkvtoolnix"
cask "musicbrainz-picard"
cask "numi"
cask "obs"
cask "opera"
cask "opera-developer"
cask "postman"
cask "processing"
cask "robo-3t"
cask "safari-technology-preview"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "slack"
cask "soundflower"
cask "spectacle"
cask "spotify"
cask "sysex-librarian"
cask "tor-browser"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "xquartz"
cask "zoom"
mas "Audulus 3", id: 1031667826
mas "Craft", id: 1487937127
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "LittleIpsum", id: 405772121
mas "Mirror for Samsung TV", id: 1107644799
mas "Nisus Thesaurus", id: 471448642
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "Things", id: 904280696
mas "Vimari", id: 1480933944
mas "WordService", id: 899972312
