1password
1password-cli
ableton-live-suite
adobe-acrobat-reader
alt-tab
arc
audacity
balenaetcher
bartender
blackhole-16ch
blackhole-2ch
blackhole-64ch
chromedriver
chromium
cleanmymac
db-browser-for-sqlite
discord
dropbox
duckduckgo
elektron-transfer
firefox
firefox-developer-edition
flacon
font-awesome-terminal-fonts
font-sf-mono
font-sf-mono-for-powerline
font-symbols-only-nerd-font
gimp
github
google-chrome-canary
google-drive
grammarly
grammarly-desktop
hyper
iina
ilok-license-manager
inkscape
iterm2
izotope-product-portal
jitsi
karabiner-elements
lastfm
linearmouse
marta
megasync
microsoft-auto-update
microsoft-edge
microsoft-edge-dev
microsoft-teams
musicbrainz-picard
native-access
numi
obs
obsidian
opera
opera-developer
postman
processing
raindropio
rar
rectangle-pro
robo-3t
sequel-pro
signal
skype
slack
soundflower
spacedrive
spectacle
spitfire-audio
spotify
sysex-librarian
tidal
tor-browser
transmission
vagrant
vimr
visual-studio-code
vlc
warp
whatsapp
xquartz
zoom
