1password
ableton-live-suite
adobe-dng-converter
aerospace
alt-tab
ankerwork
arc
arturia-software-center
audacity
balenaetcher
bartender
beeper
blackhole-16ch
blackhole-2ch
blackhole-64ch
blender
chatgpt
chromedriver
chromium
cleanmymac
cycling74-max
db-browser-for-sqlite
displaylink
elektron-overbridge
elektron-transfer
fabfilter-pro-q
figma
firefox
flacon
font-awesome-terminal-fonts
font-sf-mono
font-sf-mono-for-powerline
font-symbols-only-nerd-font
ghostty
github
google-chrome
google-drive
grammarly-desktop
hyper
iina
ilok-license-manager
iterm2
izotope-product-portal
jdownloader
karabiner-elements
lastfm
marta
microsoft-auto-update
microsoft-outlook
microsoft-teams
musicbrainz-picard
native-access
nordvpn
numi
obs
obsidian
plex-media-server
postman
processing
raindropio
rar
raycast
rectangle-pro
robo-3t
sequel-pro
sigmaos
softube-central
soundtoys
spitfire-audio
steam
sysex-librarian
tagspaces
tidal
touchdesigner
vimr
visual-studio-code
wacom-tablet
warp
whatsapp
xquartz
zed
zen
zen-browser
