1password
1password-cli
ableton-live-suite
alt-tab
ankerwork
arc
audacity
balenaetcher
bartender
beeper
blackhole-16ch
blackhole-2ch
blackhole-64ch
blender
chatgpt
chromedriver
chromium
cleanmymac
cycling74-max
db-browser-for-sqlite
discord
displaylink
dropbox
duckduckgo
elektron-transfer
elgato-camera-hub
fabfilter-pro-q
figma
firefox
firefox-developer-edition
firefox@developer-edition
flacon
font-awesome-terminal-fonts
font-sf-mono
font-sf-mono-for-powerline
font-symbols-only-nerd-font
gimp
github
google-chrome-canary
google-chrome@canary
google-drive
grammarly-desktop
hyper
iina
ilok-license-manager
inkscape
iterm2
izotope-product-portal
karabiner-elements
lastfm
marta
microsoft-auto-update
microsoft-edge
microsoft-edge-dev
microsoft-edge@dev
microsoft-outlook
microsoft-teams
musicbrainz-picard
native-access
nordvpn
numi
obs
obsidian
opera
opera-developer
opera@developer
pingid
postman
processing
raindropio
rar
rectangle-pro
robo-3t
sequel-pro
softube-central
spacedrive
spitfire-audio
steam
sysex-librarian
tagspaces
tidal
tor-browser
tunnelblick
vagrant
vimr
visual-studio-code
vlc
warp
whatsapp
xquartz
zoom
